<a href="https://colab.research.google.com/github/Samrath49/AI-with-Tensorflow/blob/master/College%20Lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd #used to convert unstructured data into tabuler form structured data
import numpy as np # it means numbers in python for numbers
import seaborn as sns # seaboen includes extra graphical functions that r not there in matplot lib
import matplotlib.pyplot as mp # mathematical ploting using graphs ets

In [4]:
data = {'Sno': [1,2,3,4,5,6],
        'Student_Id': ['S001','S002','S003','S004','S005','S006'],
        'Height(cm)':[178,174,162,176,np.NaN,166],
        'Play_Cricket':[np.NaN,0,0,0,1,0]}

In [5]:
df = pd.DataFrame(data,columns=['Sno','Student_Id','Height(cm)','Play_Cricket'])

In [6]:
df # data in tabular form as sorted data is called dataframe

   Sno Student_Id  Height(cm)  Play_Cricket
0    1       S001       178.0           NaN
1    2       S002       174.0           0.0
2    3       S003       162.0           0.0
3    4       S004       176.0           0.0
4    5       S005         NaN           1.0
5    6       S006       166.0           0.0

In [7]:
df.head(2)

   Sno Student_Id  Height(cm)  Play_Cricket
0    1       S001       178.0           NaN
1    2       S002       174.0           0.0

In [8]:
df.tail(2)

   Sno Student_Id  Height(cm)  Play_Cricket
4    5       S005         NaN           1.0
5    6       S006       166.0           0.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sno           6 non-null      int64
 1   Student_Id    6 non-null      object
 2   Height(cm)    5 non-null      float64
 3   Play_Cricket  5 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 320.0+ bytes